delgosha_m/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   0.001;

convertToMeters 0.001;
 
vertices
(
(-152 0 0)
(1111.6 -119.2 0)
(-152 50 0)
(1111.6 -9.2 0)

(-152 0 22)
(1111.6 -119.2 22)
(-152 50 22)
(1111.6 -9.2 22)

);
 
blocks
(
 hex (0 1 3 2 4 5 7 6 ) (680 150 1) simpleGrading 
(

(
(0.115 0.27 0.052)
(0.06 0.43 4)
(0.42 0.3 16)
(0.35 0.1 1)

)

(
(0.05 0.25 6)
(0.45 0.4 5)
(0.45 0.22 0.8)
(0.05 0.03 0.8)
)
1)



);
 
edges
(
polyLine 0 1 (
(-51.7 0 0)
(-42.9 2.16 0)
(-35.55 4.56 0)
(-29.28 6.59 0)
(-23.97 8.32 0)
(-9.53 13.01 0)
(-7.15 13.78 0)
(-5.17 14.43 0)
(-3.46 14.986 0)
(-2 15.46 0)
(-0.77 15.86 0)
(0.27 16.2 0)
(0.51 16.3 0)
(0.75 16.38 0)
(0.992 16.455 0)
(1.24 16.51 0)
(2.14 16.4 0)
(3.06 16.27 0)
(4 16.16 0)
(4.96 16.04 0)
(5.94 15.91 0)
(10.056 15.4 0)
(13.36 14.98 0)
(25.9 13.36 0)
(39.54 11.59 0)
(50.07 10.22 0)
(59.84 8.94 0)
(70.64 7.45 0)
(85.04 5.24 0)
(101.22 2.46 0)
(119.41 -0.881 0)
(147.25 -5.97 0)
(162.94 -8.794 0)
(179.89 -11.96 0)
(240.6 -24.02 0)
(354.19 -40.84 0)
(416.24 -50.05 0)
(459.93 -55.11 0)
)
polyLine 4 5 (
(-51.7 0 22)
(-42.9 2.16 22)
(-35.55 4.56 22)
(-29.28 6.59 22)
(-23.97 8.32 22)
(-9.53 13.01 22)
(-7.15 13.78 22)
(-5.17 14.43 22)
(-3.46 14.986 22)
(-2 15.46 22)
(-0.77 15.86 22)
(0.27 16.2 22)
(0.51 16.3 22)
(0.75 16.38 22)
(0.992 16.455 22)
(1.24 16.51 22)
(2.14 16.4 22)
(3.06 16.27 22)
(4 16.16 22)
(4.96 16.04 22)
(5.94 15.91 22)
(10.056 15.4 22)
(13.36 14.98 22)
(25.9 13.36 22)
(39.54 11.59 22)
(50.07 10.22 22)
(59.84 8.94 22)
(70.64 7.45 22)
(85.04 5.24 22)
(101.22 2.46 22)
(119.41 -0.881 22)
(147.25 -5.97 22)
(162.94 -8.794 22)
(179.89 -11.96 22)
(240.6 -24.02 22)
(354.19 -40.84 22)
(416.24 -50.05 22)
(459.93 -55.11 22)
)
polyLine 2 3(
(116.11 50 0)
(122.61 49.93 0)
(132.87 49.71 0)
(151.376 48.93 0)
(171.67 47.83 0)
(189.37 46.84 0)
(203.55 46.083 0)
(213.5 45.52 0)
(246.88 43.71 0)
(341.195 38.51 0)
(445.37 32.78 0)


)

polyLine 6 7(
(116.11 50 22)
(122.61 49.93 22)
(132.87 49.71 22)
(151.376 48.93 22)
(171.67 47.83 22)
(189.37 46.84 22)
(203.55 46.083 22)
(213.5 45.52 22)
(246.88 43.71 22)
(341.195 38.51 22)
(445.37 32.78 22)


)


);
 
boundary
(

inlet 
{
    type patch;
     faces
(
     (0 2 6 4)
);
}
outlet 
{
    type patch;
     faces
(
     (1 3 7 5)
);
}
front
{
    type empty;
     faces
(
     (0 1 2 3)
);
}
back
{
    type empty;
     faces
(
     (4 5 6 7)
);
}
hub
{
    type wall;
     faces
(
     (0 4 5 1)
);
}
tip
{
    type wall;
     faces
(
     (2 6 7 3)
);
}

          );
 
mergePatchPairs
(
);
// ************************************************************************* //
