delgosha_m/system/blockMeshDict_yplus7
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   0.001;

convertToMeters 0.001;
 
vertices
(
(-152 0 0)
(1111.6 -119.2 0)
(-152 50 0)
(1111.6 -9.2 0)

(-152 0 1)
(1111.6 -119.2 1)
(-152 50 1)
(1111.6 -9.2 1)

);
 
blocks
(
 hex (0 1 3 2 4 5 7 6 ) (480 100 1) simpleGrading 
(

(
(0.115 0.33 0.05)
(0.28 0.62 26)
(0.3 0.1 4)
(0.25 0.05 1)

)

(
(0.05 0.13 10)
(0.45 0.35 2)
(0.45 0.35 0.5)
(0.05 0.15 0.1)
)
1)



);
 
edges
(
polyLine 0 1 (
(-51.7 0 0)
(-42.9 2.16 0)
(-35.55 4.56 0)
(-29.28 6.59 0)
(-23.97 8.32 0)
(-9.53 13.01 0)
(-7.15 13.78 0)
(-5.17 14.43 0)
(-3.46 14.986 0)
(-2 15.46 0)
(-0.77 15.86 0)
(0.27 16.2 0)
(0.51 16.3 0)
(0.75 16.38 0)
(0.992 16.455 0)
(1.24 16.51 0)
(2.14 16.4 0)
(3.06 16.27 0)
(4 16.16 0)
(4.96 16.04 0)
(5.94 15.91 0)
(10.056 15.4 0)
(13.36 14.98 0)
(25.9 13.36 0)
(39.54 11.59 0)
(50.07 10.22 0)
(59.84 8.94 0)
(70.64 7.45 0)
(85.04 5.24 0)
(101.22 2.46 0)
(119.41 -0.881 0)
(147.25 -5.97 0)
(162.94 -8.794 0)
(179.89 -11.96 0)
(240.6 -24.02 0)
(354.19 -40.84 0)
(416.24 -50.05 0)
(459.93 -55.11 0)
)
polyLine 4 5 (
(-51.7 0 1)
(-42.9 2.16 1)
(-35.55 4.56 1)
(-29.28 6.59 1)
(-23.97 8.32 1)
(-9.53 13.01 1)
(-7.15 13.78 1)
(-5.17 14.43 1)
(-3.46 14.986 1)
(-2 15.46 1)
(-0.77 15.86 1)
(0.27 16.2 1)
(0.51 16.3 1)
(0.75 16.38 1)
(0.992 16.455 1)
(1.24 16.51 1)
(2.14 16.4 1)
(3.06 16.27 1)
(4 16.16 1)
(4.96 16.04 1)
(5.94 15.91 1)
(10.056 15.4 1)
(13.36 14.98 1)
(25.9 13.36 1)
(39.54 11.59 1)
(50.07 10.22 1)
(59.84 8.94 1)
(70.64 7.45 1)
(85.04 5.24 1)
(101.22 2.46 1)
(119.41 -0.881 1)
(147.25 -5.97 1)
(162.94 -8.794 1)
(179.89 -11.96 1)
(240.6 -24.02 1)
(354.19 -40.84 1)
(416.24 -50.05 1)
(459.93 -55.11 1)
)
polyLine 2 3(
(116.11 50 0)
(122.61 49.93 0)
(132.87 49.71 0)
(151.376 48.93 0)
(171.67 47.83 0)
(189.37 46.84 0)
(203.55 46.083 0)
(213.5 45.52 0)
(246.88 43.71 0)
(341.195 38.51 0)
(445.37 32.78 0)


)

polyLine 6 7(
(116.11 50 1)
(122.61 49.93 1)
(132.87 49.71 1)
(151.376 48.93 1)
(171.67 47.83 1)
(189.37 46.84 1)
(203.55 46.083 1)
(213.5 45.52 1)
(246.88 43.71 1)
(341.195 38.51 1)
(445.37 32.78 1)


)


);
 
boundary
(

inlet 
{
    type patch;
     faces
(
     (0 2 6 4)
);
}
outlet 
{
    type patch;
     faces
(
     (1 3 7 5)
);
}
front
{
    type empty;
     faces
(
     (0 1 2 3)
);
}
back
{
    type empty;
     faces
(
     (4 5 6 7)
);
}
hub
{
    type wall;
     faces
(
     (0 4 5 1)
);
}
tip
{
    type wall;
     faces
(
     (2 6 7 3)
);
}

          );
 
mergePatchPairs
(
);
// ************************************************************************* //
