delgosha_m/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          150;
        startFace       203170;
    }
    outlet
    {
        type            patch;
        nFaces          150;
        startFace       203320;
    }
    front
    {
        type            empty;
        inGroups        1(empty);
        nFaces          102000;
        startFace       203470;
    }
    back
    {
        type            empty;
        inGroups        1(empty);
        nFaces          102000;
        startFace       305470;
    }
    hub
    {
        type            wall;
        inGroups        1(wall);
        nFaces          680;
        startFace       407470;
    }
    tip
    {
        type            wall;
        inGroups        1(wall);
        nFaces          680;
        startFace       408150;
    }
)

// ************************************************************************* //
