delgosha_m/constant/cloudPositions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       vectorField;
    object      cloudPositions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

(
(0.0223075 0.00293684 0.005)
(0.0207873 0.00861038 0.005)
(0.0178505 0.0136971 0.005)
(0.0136971 0.0178505 0.005)
(0.00861038 0.0207873 0.005)
(0.00293684 0.0223075 0.005)
(-0.00293684 0.0223075 0.005)
(-0.00861038 0.0207873 0.005)
(-0.0136971 0.0178505 0.005)
(-0.0178505 0.0136971 0.005)
(-0.0207873 0.00861038 0.005)
(-0.0223075 0.00293684 0.005)
(-0.0223075 -0.00293684 0.005)
(-0.0207873 -0.00861038 0.005)
(-0.0178505 -0.0136971 0.005)
(-0.0136971 -0.0178505 0.005)
(-0.00861038 -0.0207873 0.005)
(-0.00293684 -0.0223075 0.005)
(0.00293684 -0.0223075 0.005)
(0.00861038 -0.0207873 0.005)
(0.0136971 -0.0178505 0.005)
(0.0178505 -0.0136971 0.005)
(0.0207873 -0.00861038 0.005)
(0.0223075 -0.00293684 0.005)
(0.0273676 0.00269547 0.005)
(0.0263159 0.00798283 0.005)
(0.0242528 0.0129634 0.005)
(0.0212578 0.0174458 0.005)
(0.0174458 0.0212578 0.005)
(0.0129634 0.0242528 0.005)
(0.00798283 0.0263159 0.005)
(0.00269547 0.0273676 0.005)
(-0.00269547 0.0273676 0.005)
(-0.00798283 0.0263159 0.005)
(-0.0129634 0.0242528 0.005)
(-0.0174458 0.0212578 0.005)
(-0.0212578 0.0174458 0.005)
(-0.0242528 0.0129634 0.005)
(-0.0263159 0.00798283 0.005)
(-0.0273676 0.00269547 0.005)
(-0.0273676 -0.00269547 0.005)
(-0.0263159 -0.00798283 0.005)
(-0.0242528 -0.0129634 0.005)
(-0.0212578 -0.0174458 0.005)
(-0.0174458 -0.0212578 0.005)
(-0.0129634 -0.0242528 0.005)
(-0.00798283 -0.0263159 0.005)
(-0.00269547 -0.0273676 0.005)
(0.00269547 -0.0273676 0.005)
(0.00798283 -0.0263159 0.005)
(0.0129634 -0.0242528 0.005)
(0.0174458 -0.0212578 0.005)
(0.0212578 -0.0174458 0.005)
(0.0242528 -0.0129634 0.005)
(0.0263159 -0.00798283 0.005)
(0.0273676 -0.00269547 0.005)
(0.0323998 0.00254992 0.005)
(0.031602 0.00758697 0.005)
(0.0300261 0.0124372 0.005)
(0.0277108 0.0169812 0.005)
(0.0247132 0.0211071 0.005)
(0.0211071 0.0247132 0.005)
(0.0169812 0.0277108 0.005)
(0.0124372 0.0300261 0.005)
(0.00758697 0.031602 0.005)
(0.00254992 0.0323998 0.005)
(-0.00254992 0.0323998 0.005)
(-0.00758697 0.031602 0.005)
(-0.0124372 0.0300261 0.005)
(-0.0169812 0.0277108 0.005)
(-0.0211071 0.0247132 0.005)
(-0.0247132 0.0211071 0.005)
(-0.0277108 0.0169812 0.005)
(-0.0300261 0.0124372 0.005)
(-0.031602 0.00758697 0.005)
(-0.0323998 0.00254992 0.005)
(-0.0323998 -0.00254992 0.005)
(-0.031602 -0.00758697 0.005)
(-0.0300261 -0.0124372 0.005)
(-0.0277108 -0.0169812 0.005)
(-0.0247132 -0.0211071 0.005)
(-0.0211071 -0.0247132 0.005)
(-0.0169812 -0.0277108 0.005)
(-0.0124372 -0.0300261 0.005)
(-0.00758697 -0.031602 0.005)
(-0.00254992 -0.0323998 0.005)
(0.00254992 -0.0323998 0.005)
(0.00758697 -0.031602 0.005)
(0.0124372 -0.0300261 0.005)
(0.0169812 -0.0277108 0.005)
(0.0211071 -0.0247132 0.005)
(0.0247132 -0.0211071 0.005)
(0.0277108 -0.0169812 0.005)
(0.0300261 -0.0124372 0.005)
(0.031602 -0.00758697 0.005)
(0.0323998 -0.00254992 0.005)
(0.0373844 0.00294222 0.005)
(0.0364639 0.0087542 0.005)
(0.0346455 0.0143506 0.005)
...
)


// ************************************************************************* //
