delgosha_m/0/U_original
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
102000
(
(5.73804 0.0162256 -1.16403e-33)
(4.84885 0.00716315 -1.13202e-33)
(4.66221 0.00572607 -8.74066e-34)
(4.21167 0.00303686 -7.17696e-34)
(3.9246 0.00205204 -7.66564e-37)
(3.66231 0.00137818 3.5581e-34)
(3.5947 0.00125616 3.13234e-34)
(3.5164 0.00101967 0)
...
)
;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (7.2 0 0);
    }
    outlet
    {
        type            zeroGradient;
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
    hub
    {
        type            noSlip;
    }
    tip
    {
        type            noSlip;
    }
}


// ************************************************************************* //
