delgosha_m/0/p_rgh_original
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
102000
(
57759.3
57172.3
57107.6
57088.6
56902.9
56910.4
56894.9
56824.7
...
)
;

boundaryField
{
    inlet
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           nonuniform List<scalar> 
150
(
57786.2
57813.2
57800.7
57800.7
57798
57790
57790
57783.1
...
)
;
    }
    outlet
    {
       type            prghPressure;
        p               uniform 65000;
        value           uniform 65000;
     }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
    hub
    {
        type            zeroGradient;
    }
    tip
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
