delgosha_m/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
102000
(
3.23013
2.45501
2.11921
1.27546
1.07347
1.03382
1.02959
0.974161
...
)
;

boundaryField
{
    inlet
    {
        type            turbulentIntensityKineticEnergyInlet;
        intensity       0.03;
        value           uniform 0.1944;
    }
    outlet
    {
        type            zeroGradient;
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
    hub
    {
        type            fixedValue;
        value           nonuniform List<scalar> 
680
(
0.427972
0.427972
0.427972
0.328653
0.287255
0.287255
0.287255
0.270302
...
)
;
    }
    tip
    {
        type       kqRWallFunction;
        value           uniform 0;
           }
}


// ************************************************************************* //
