delgosha_m/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
102000
(
1.32309e-05
1.15172e-05
1.12028e-05
1.06967e-05
9.85007e-06
8.92712e-06
8.61586e-06
8.94013e-06
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
150
(
4.42607e-07
3.56426e-06
6.03743e-06
6.03743e-06
9.45241e-06
1.61992e-05
1.61992e-05
3.42196e-05
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
150
(
3.41604e-06
6.15475e-06
1.03392e-05
1.03392e-05
1.64683e-05
2.50475e-05
2.50475e-05
3.66852e-05
...
)
;
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
    hub
    {
        type            fixedValue;
        value           nonuniform List<scalar> 
680
(
6.82499e-09
6.82499e-09
6.82499e-09
0
0
0
0
0
...
)
;
    }
    tip
    {
        type           nutUWallFunction; 
 value           uniform 0;

    }
}


// ************************************************************************* //
