delgosha_m/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
102000
(
216774
180050
160480
108164
100557
103992
105869
99983.2
...
)
;

boundaryField
{
    inlet
    {
        type            turbulentMixingLengthFrequencyInlet;
        mixingLength    0.0044;
        phi             phi;
        k               k;
        value           uniform 182.951;
    }
    outlet
    {
        type            zeroGradient;
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
    hub
    {
        type            fixedValue;
        value           nonuniform List<scalar> 
680
(
188898
188898
188898
178471
173940
173940
173940
172051
...
)
;
    }
    tip
    {
       
         type            omegaWallFunction;
         beta1           0.075;
         blending        binomial2;
         n               2.0;
         value  uniform 100000;
         }
}


// ************************************************************************* //
