delgosha_m/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |				
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8                                   	
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    //default         Gauss linear;
    default        cellLimited Gauss linear 1;
    limitedGrad    cellLimited Gauss linear 1;
}

divSchemes
{
    div(rhoPhi,U)  Gauss linearUpwindV default;
    div(phi,alpha)  Gauss vanLeer;


    //div(phi,alpha)   Gauss vanLeer;
   // div(phi,alpha)   Gauss interfaceCompression vanLeer 1;

//For OF7 and older
    //div(phi,alpha)   Gauss vanLeer;
      div(phirb,alpha) Gauss linear;
    //div(phirb,alpha) Gauss interfaceCompression;


    div(phi,k)      bounded Gauss upwind;
    div(phi,omega)  bounded Gauss upwind;
   // div(phi,k)      Gauss linearUpwind limitedGrad;
    div(phi,gamma)  Gauss linearUpwind limitedGrad;

    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear limited 0.5;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         limited 0.5;
}

wallDist
{
    method meshWave;
}

// ************************************************************************* //
