delgosha_m/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |				
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8                                   	
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "alpha.water.*"
    {
        nAlphaCorr      3;
        nAlphaSubCycles 4;
        cAlpha          0;
        icAlpha         0;

        MULESCorr       yes;
        nLimiterIter    5;
        alphaApplyPrevCorr  yes;

        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-8;
        relTol          0;
        minIter         1;
    }

    "pcorr.*"
    {
        solver          PCG;

        preconditioner
        {
            preconditioner  GAMG;

            smoother        GaussSeidel;

            tolerance       1e-6;
            relTol          0;
        };

        tolerance       1e-6;
        relTol          0;
	minIter		1;
    };

    p_rgh
    {
        solver          GAMG;

        smoother        DIC;

        tolerance       1e-6;
        relTol          0.01;
        minIter         1;
    };

    p_rghFinal
    {
        $p_rgh;
        relTol          0;
	minIter		1;
    }

    "(U|k|omega|gamma).*"
    {
/*
        solver          smoothSolver;
        smoother        GaussSeidel;
        nSweeps         1;
        tolerance       1e-7;
        relTol          0.1;
*/

/*
        type            coupled;
        solver          PBiCCCG;
        preconditioner  DILU;
        tolerance       (1e-08 1e-08 1e-08);
        relTol          (0.01 0.01 0.01);
*/

        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-08;
        relTol          0.001;
	minIter		1;
    };
}

PIMPLE
{
    momentumPredictor yes;
    consistent         yes;
    nOuterCorrectors    2;
    nCorrectors         3;
    nNonOrthogonalCorrectors 2;
    turbOnFinalIterOnly yes;
   // pMin   3000;
}

relaxationFactors
{
    fields
    {
        ".*" 0.9;
    }
    equations
    {
        ".*" 0.9;
    }
}

cache
{
    grad(U);
}

// ************************************************************************* //
